Repository: Nokse22/ascii-draw
Catalog: po/*.po
Languages: hi, pt_br, vi, zh

source: Sketch anything using characters
hi: वर्णों का उपयोग करके रेखाचित्र बनाएं
pt_br: Esboce qualquer coisa usando personagens
vi: Phác thảo mọi thứ bằng ký tự
zh: 使用字符绘制任何内容

source: Draw diagrams, tables, tree view, art and more using only characters. There are many tools and features available such as:
pt_br: Desenhe diagramas, mesas, vista para árvores, arte e muito mais usando apenas caracteres. Existem muitas ferramentas e recursos disponíveis, como:
vi: Vẽ sơ đồ, bảng, cây, nghệ thuật và hơn thế nữa chỉ bằng ký tự. Có nhiều công cụ và tính năng như:
zh: 仅使用字符绘制图表、表格、树状视图、艺术等。有许多工具，例如：

source: Rectangle using multiple line styles
pt_br: Retângulo usando vários estilos de linha
vi: Hình chữ nhật với nhiều kiểu đường
zh: 使用多种线条样式的矩形

source: Filled Rectangle using border and fill characters
pt_br: Retângulo preenchido usando personagens de borda e enchimento
vi: Hình chữ nhật tô dùng ký tự viền và ký tự nền
zh: 使用边框和填充字符的填充矩形

source: Cartesian, Freehand and Stepped line, also with arrows
pt_br: Linha cartesiana, à mão livre e escalonada, também com flechas
vi: Đường Cartesian, Tự Do và Bậc Thang, kèm theo mũi tên
zh: 笛卡尔、手绘和阶梯线，也带箭头

source: Freehand Brush
hi: मुक्तहस्त ब्रश
pt_br: Escova à mão livre
vi: Cọ Vẽ Tự Do
zh: 画笔

source: Text with FIGlet fonts
hi: FIGlet फॉन्ट के साथ पाठ
pt_br: Texto com fontes figlet
vi: Văn bản với phông FIGlet
zh: FIGlet 字体文本

source: Table
hi: तालिका
pt_br: Mesa
vi: Bảng
zh: 表格

source: Tree View
hi: वृक्ष दृश्य
pt_br: Vista em árvore
vi: Cây
zh: 查看树视图

source: Eraser
hi: रबड़
pt_br: Apagador
vi: Tẩy
zh: 橡皮擦

source: Character Picker
hi: वर्ण चयनकर्ता
pt_br: Picker de personagem
vi: Bộ Chọn Ký Tự
zh: 选择字符

source: Move and Rotate selection
pt_br: Mover e girar a seleção
vi: Di Chuyển và Xoay vùng chọn
zh: 移动和旋转

source: Flood Fill
pt_br: Preenchimento de inundação
vi: Tô Vùng
zh: 填充

source: ASCII Art of an old television
hi: एक पुराने टेलीविजन की ASCII कला
pt_br: ASCII ART de uma televisão antiga
vi: Tranh ASCII của chiếc tivi cổ
zh: 旧电视的 ASCII 艺术

source: CPU simplified structure
hi: CPU सरलीकृत संरचना
pt_br: Estrutura simplificada da CPU
vi: Cấu trúc CPU (đơn giản)
zh: CPU 简化结构

source: Table of countries, capitals and population
hi: देशों, राजधानियों और जनसंख्या की तालिका
pt_br: Tabela de países, capitais e população
vi: Bảng các quốc gia, thủ đô và dân số
zh: 国家、首都和人口表

source: A flowchart to fix a lamp
hi: लैंप को ठीक करने के लिए प्रवाहसंचित्र
pt_br: Um fluxograma para consertar uma lâmpada
vi: Lưu đồ sửa đèn
zh: 固定灯的流程图

source: An example of a treeview
hi: वृक्षदृश्य का उदाहरण
pt_br: Um exemplo de uma visão de árvore
vi: Ví dụ về xem dạng cây
zh: 树视图示例

source: Cartesian, stepped and freehand lines
hi: कार्तीय, चरणबद्ध और मुक्तहस्त रेखाएं
pt_br: Linhas cartesianas, pisadas e à mão livre
vi: Các đường Cartesian, bậc thang và tự do
zh: 笛卡尔、阶梯和手绘线

source: Move and Rotate Tool
pt_br: Mover e girar a ferramenta
vi: Công cụ Di Chuyển và Xoay
zh: 移动和旋转工具

# shortcut window
source: General
hi: सामान्य
pt_br: Em geral
vi: Chung
zh: 常规

# shortcut window
source: Show Shortcuts
hi: शॉर्टकट दिखाएं
pt_br: Mostre atalhos
vi: Hiện Phím Tắt
zh: 显示快捷键

# shortcut window
source: Save
hi: सहेजें
pt_br: Salve
vi: Lưu
zh: 保存

# shortcut window
source: Save As
hi: ऐसे सहेजें
pt_br: Salve como
vi: Lưu Thành
zh: 另存为

# shortcut window
source: Open
hi: खोलें
pt_br: Abrir
vi: Mở
zh: 打开

# shortcut window
source: New Canvas
hi: नया कैनवास
pt_br: Nova tela
vi: Khung Vẽ Mới
zh: 新文件

# shortcut window
source: Undo
hi: पूर्ववत करें
pt_br: Desfazer
vi: Hoàn Tác
zh: 撤销

# shortcut window
source: Redo
hi: पुनः करें
pt_br: Refazer
vi: Làm Lại
zh: 恢复

# shortcut window
source: Tools
hi: औजार
pt_br: Ferramentas
vi: Công Cụ
zh: 工具

# shortcut window
source: Rectangle
hi: आयत
pt_br: Retângulo
vi: Hình Chữ Nhật
zh: 矩形

# shortcut window
source: Filled Rectangle
hi: भरा हुआ आयत
pt_br: Retângulo preenchido
vi: Hình Chữ Nhật Tô
zh: 矩形填充

# shortcut window
source: Line
hi: रेखा
pt_br: Linha
vi: Đường
zh: 线条

# shortcut window
source: Freehand Brush
hi: मुक्तहस्त ब्रश
pt_br: Escova à mão livre
vi: Cọ Vẽ Tự Do
zh: 画笔

# shortcut window
source: Text
hi: पाठ
pt_br: Texto
vi: Văn Bản
zh: 文本

# shortcut window
source: Table
hi: तालिका
pt_br: Mesa
vi: Bảng
zh: 表格

# shortcut window
source: Tree View
hi: वृक्ष दृश्य
pt_br: Vista em árvore
vi: Cây
zh: 树视图

# shortcut window
source: Eraser
hi: रबड़
pt_br: Apagador
vi: Tẩy
zh: 橡皮擦

# shortcut window
source: Picker
hi: चयनकर्ता
vi: Chọn
zh: 选择

# shortcut window
source: Move
hi: स्थानान्तर
pt_br: Mover
vi: Di Chuyển
zh: 移动

# shortcut window
source: Fill
pt_br: Preencher
vi: Tô
zh: 填充

source: New palette
hi: नया पैलेट
pt_br: Nova paleta
vi: Bảng màu mới
zh: 新建字符集

source: Palette name
hi: पैलेट का नाम
pt_br: Nome da paleta
vi: Tên bảng màu
zh: 字符集名称

source: Save
hi: सहेजें
pt_br: Salve
vi: Lưu
zh: 保存

source: Undo
hi: पूर्ववत करें
pt_br: Desfazer
vi: Hoàn Tác
zh: 撤销

source: Redo
pt_br: Refazer
vi: Làm Lại
zh: 恢复

source: Toggle Sidebar
pt_br: Alterne a barra lateral
vi: Bật/Tắt Thanh Bên
zh: 显示侧边栏

source: Rectangle Ctrl+R
hi: आयत (Ctrl+R)
pt_br: Retângulo ctrl+r
vi: Hình chữ nhật Ctrl+R
zh: 矩形 Ctrl+R

source: Filled rectangle Ctrl+Shift+R
hi: भरा हुआ आयत (Ctrl+Shift+R)
pt_br: Retângulo preenchido ctrl+shift+r
vi: Hình chữ nhật tô Ctrl+Shift+R
zh: 填充矩形 Ctrl+Shift+R

source: Line Ctrl+L
hi: रेखा (Ctrl+L)
pt_br: Linha ctrl+l
vi: Đường Ctrl+L
zh: 线条 Ctrl+L

source: Freehand Ctrl+F
hi: मुक्तहस्त (Ctrl+F)
pt_br: Desenho livre Ctrl+F
vi: Cọ vẽ Ctrl+F
zh: 画笔 Ctrl+F

source: Text Ctrl+T
hi: पाठ (Ctrl+T)
pt_br: Texto ctrl+t
vi: Văn bản Ctrl+T
zh: 文本 Ctrl+T

source: Table Ctrl+Shift+T
hi: तालिका (Ctrl+Shift+T)
pt_br: Tabela Ctrl+Shift+T
vi: Bảng Ctrl+Shift+T
zh: 表格 Ctrl+Shift+T

source: Tree view Ctrl+U
hi: वृक्ष दृश्य (Ctrl+U)
pt_br: Vista de árvore Ctrl+u
vi: Cây Ctrl+U
zh: 树视图 Ctrl+U

source: Eraser Ctrl+E
hi: रबड़ (Ctrl+E)
pt_br: Borracha Ctrl+E
vi: Tẩy Ctrl+E
zh: 橡皮擦 Ctrl+E

source: Picker Ctrl+P
hi: चयनकर्ता (Ctrl+P)
pt_br: Seletor Ctrl+P
vi: Chọn Ctrl+P
zh: 选择 Ctrl+P

source: Move Ctrl+M
hi: स्थानान्तर (Ctrl+M)
pt_br: "Mover Ctrl+M"
vi: Di chuyển Ctrl+M
zh: 移动 Ctrl+M

source: Fill Ctrl+Shift+F
pt_br: Preencher Ctrl+Shift+F
vi: Tô Ctrl+Shift+F
zh: 填充 Ctrl+Shift+F

source: Primary Character
hi: प्राथमिक वर्ण
pt_br: Caráter primário
vi: Ký Tự Chính
zh: 边框

source: Secondary Character
hi: द्वितीयक वर्ण
pt_br: Caráter secundário
vi: Ký Tự Phụ
zh: 填充

source: Close Sidebar
pt_br: Barra lateral próxima
vi: Đóng Thanh Bên
zh: 关闭侧边栏

source: Main Menu
pt_br: Menu principal
vi: Menu Chính
zh: 菜单

source: Resize Canvas
pt_br: Redimensione tela
vi: Thay Đổi Kích Thước Khung Vẽ
zh: 调整大小

source: Width
hi: चौड़ाई
pt_br: Largura
vi: Chiều Rộng
zh: 宽

source: Height
hi: ऊंचाई
pt_br: Altura
vi: Chiều Cao
zh: 高

source: Change size
hi: आकार बदलें
pt_br: Tamanho da mudança
vi: Thay đổi kích thước
zh: 改变大小

source: Character
hi: वर्ण
pt_br: Personagem
vi: Ký Tự
zh: 字符

source: Style
hi: शैली
pt_br: Estilo
vi: Kiểu
zh: 风格

source: Clear Canvas
hi: कैनवास साफ करें
pt_br: Limpar Tela
vi: Xóa Khung Vẽ
zh: 清空画布

source: New Palette
hi: नया पैलेट
pt_br: Nova paleta
vi: Bảng Màu Mới
zh: 新字符集

source: New Palette From Canvas
hi: कैनवास से नया पैलेट
pt_br: Nova paleta da tela
vi: Tạo Bảng Màu Mới Từ Khung Vẽ
zh: 从画布创建新字符集

source: Open Palettes Folder
pt_br: Pasta de paletas abertas
vi: Mở Thư Mục Bảng Màu
zh: 打开字符集文件夹

source: Keyboard Shortcuts
hi: कीबोर्ड शॉर्टकट
pt_br: Atalhos de teclado
vi: Phím Tắt
zh: 快捷键

source: About ASCII Draw
hi: ASCII Draw के बारे में
pt_br: Sobre o ASCII Draw
vi: Thông Tin Về ASCII Draw
zh: 关于 ASCII 绘画

source: Copy To Clipboard
hi: क्लिपबोर्ड पर कॉपी करें
pt_br: Cópia para a área de transferência
vi: Sao Chép Vào Bộ Nhớ Tạm
zh: 复制

source: Save As
hi: ऐसे सहेजें
pt_br: Salve como
vi: Lưu Thành
zh: 另存为

source: Open
hi: खोलें
pt_br: Abrir
vi: Mở
zh: 打开

source: New Canvas
hi: नया कैनवास
pt_br: Nova tela
vi: Khung Vẽ Mới
zh: 新文件

source: Size
hi: आकार
vi: Kích Thước

source: Freehand
hi: मुक्तहस्त
pt_br: Desenho Livre
vi: Tự Do
zh: 画笔

source: Step
hi: चरण
vi: Bậc thang

source: Type
hi: प्रकार
vi: Loại

source: Arrow
hi: तीर
vi: Mũi Tên

source: Line
hi: रेखा
vi: Đường

source: Rotate
pt_br: Girar
vi: Xoay
zh: 旋转

source: Copy
vi: Sao Chép

source: Delete
vi: Xóa

source: Press CTRL and move to duplicate
vi: Nhấn CTRL và di chuyển để nhân bản

source: Move
hi: स्थानान्तर
pt_br: Mover
vi: Di Chuyển
zh: 移动

source: Columns
hi: स्तंभ
vi: Cột

source: Rows
hi: पंक्तियां
vi: Hàng

source: Add a row
hi: पंक्ति जोड़ें
vi: Thêm một hàng

source: Delete rows
hi: पंक्तियां मिटाएं
vi: Xóa hàng

source: First line divided
hi: पहली पंक्ति विभाजित
vi: Dòng đầu chia

source: Divide each row
hi: हर पंक्ति को विभाजित करें
vi: Chia mỗi hàng

source: Not divided
hi: विभाजित नहीं
vi: Không chia

source: Choose Font
vi: Chọn Phông

source: Vertical Text
vi: Văn Bản Dọc

source: Spaces do not overwrite
vi: Khoảng trắng không ghi đè

source: Transparent spaces
hi: पारदर्शी स्थान
vi: Khoảng trắng trong suốt

source: Cancel
hi: रद्द करें
pt_br: Cancelar
vi: Hủy
zh: 取消

source: Select
vi: Chọn

source: Text
hi: पाठ
pt_br: Texto
vi: Văn Bản
zh: 文本

source: Tree view
hi: वृक्ष दृश्य
vi: Cây

source: Clear
hi: साफ
pt_br: Limpar
vi: Xóa
zh: 清空

source: translator-credits
hi: Scrambled777 <weblate.scrambled777@simplelogin.com>
pt_br: créditos de tradutor
vi: Loccun <huynhloc.contact@gmail.com>

source: Save File?
hi: फाइल सहेजें?
pt_br: Salvar o arquivo?
vi: Lưu Tệp?
zh: 保存文件?

source: You have never saved this file. Changes which are not saved will be permanently lost.
hi: आपने यह फाइल कभी सहेजी नहीं है। जो परिवर्तन सहेजे नहीं गए वे स्थायी रूप से नष्ट हो जाएंगे।
pt_br: Você nunca salvou esse arquivo. Alterações que não são salvas serão perdidas permanentemente.
vi: Bạn chưa bao giờ lưu tệp này. Các thay đổi chưa được lưu sẽ bị mất vĩnh viễn.
zh: 您从未保存过此文件。未保存的更改将会丢失

source: Discard
hi: त्यागें
pt_br: Descartar
vi: Bỏ
zh: 不保存

source: Save changes?
hi: परिवर्तन सहेजें?
pt_br: Salvar mudanças?
vi: Lưu thay đổi?
zh: 未保存的更改

source: The opened file contains unsaved changes. Changes which are not saved will be permanently lost.
hi: खोली गई फाइल में सहेजे न गए परिवर्तन शामिल हैं। जो परिवर्तन सहेजे नहीं गए वे स्थायी रूप से नष्ट हो जाएंगे।
pt_br: O arquivo aberto contém alterações não salvas. Alterações que não são salvas serão perdidas permanentemente.
vi: Tệp đã mở chứa các thay đổi chưa lưu. Các thay đổi chưa được lưu sẽ bị mất vĩnh viễn.
zh: 您从未保存过此文件。未保存的更改将会丢失

source: Filled Rectangle
hi: भरा हुआ आयत
pt_br: Retângulo preenchido
vi: Hình chữ nhật tô
zh: 填充矩形

source: Freehand Line
hi: मुक्तहस्त रेखा
pt_br: Linha Livre
vi: Đường tự do
zh: 线条

source: Cartesian Line
hi: कार्तीय रेखा
pt_br: Linha Cartesiana
vi: Đường Cartesian

source: Step Line
hi: चरण रेखा
pt_br: Linha em Degraus
vi: Đường Bậc Thang

source: Rectangle
hi: आयत
pt_br: Retângulo
vi: Hình Chữ Nhật
zh: 矩形

source: Tree
hi: वृक्ष
pt_br: Árvore
vi: Cây
zh: 树视图

source: Open File
hi: फाइल खोलें
pt_br: Arquivo aberto
vi: Mở Tệp
zh: 打开文件

source: Save Changes?
hi: परिवर्तन सहेजें?
pt_br: Salvar mudanças?
vi: Lưu Thay Đổi?
zh: 未保存的更改

source: Save File
hi: फाइल सहेजें
pt_br: Salvar o arquivo
vi: Lưu Tệp
zh: 保存文件

source: Saved successfully
hi: सफलतापूर्वक सहेजा गया
pt_br: Salvo com sucesso
vi: Đã lưu thành công
zh: 已保存

source: Undo
hi: पूर्ववत करें
pt_br: Desfazer
vi: Hoàn Tác
zh: 撤销

source: Redo
hi: पुनः करें
pt_br: Refazer
vi: Làm Lại
zh: 恢复

source: GNOME;GTK;Graphics;Art;
hi: GNOME;GTK;चित्रोपमा;कला;
pt_br: Gnome; gtk; gráficos; art;

source: This app lets you draw diagrams, tables, tree view, art and more using only characters. There are many stiles to choose from and multiple tools available to use such as:
hi: यह ऐप आपको केवल वर्णों का उपयोग करके आरेख, तालिकाएं, वृक्षदृश्य, कला और बहुत कुछ बनाने की सुविधा देता है। चुनने के लिए कई शैलियां हैं और उपयोग के लिए कई उपकरण उपलब्ध हैं जैसे:

source: Cartesian, freehand and stepped line
hi: कार्तीय, मुक्तहस्त और चरणबद्ध रेखा

source: Select and move
hi: चुनें और स्थानांतरित करें

source: Spaces do not overwrite
hi: रिक्त स्थान अधिलेखित नहीं होते

source: Enter
hi: दर्ज करें

source: Cartesian
hi: कार्तीय

source: drawing.txt
hi: चित्रकला.txt

source: ASCII Draw
zh: ASCII 绘画
